lib/tasks/dev.rake

INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Comercial"], ["created_at", "2024-10-14 02:12:17.779580"], ["updated_at", "2024-10-14 02:12:17.779580"]]
INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at", "kind_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Tyrone Bahringer"], ["email", "[FILTERED]"], ["birthdate", "1979-01-25"], ["created_at", "2024-10-14 02:12:18.026232"], ["updated_at", "2024-10-14 02:12:18.026232"], ["kind_id", 3]]
INSERT INTO "phones" ("number", "contact_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["number", "(14) 5637-6521"], ["contact_id", 1], ["created_at", "2024-10-14 03:11:20.122086"], ["updated_at", "2024-10-14 03:11:20.122086"]]
---
  task setup: :environment do
    puts "Registering contact types!"

    kinds = %w(Comercial Friend Brother)
    kind_records = kinds.map do |kind|
      Kind.create!(description: kind)
    end

    puts "Contact types successfully registered!"

    puts "Registering contacts"
    100.times do |i|
      contact = Contact.create!(
        name: Faker::Name.name,
        email: Faker::Internet.email,
        birthdate: Faker::Date.birthday(min_age: 18, max_age: 65),
        kind_id: kind_records.sample.id
      )

      # Criação de telefones associados ao contato
      Random.rand(5).times do
        phone = Phone.create!(number: Faker::PhoneNumber.phone_number, contact: contact)