app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at", "kind_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Tyrone Bahringer"], ["email", "[FILTERED]"], ["birthdate", "1979-01-25"], ["created_at", "2024-10-14 02:28:04.107445"], ["updated_at", "2024-10-14 02:28:04.107445"], ["kind_id", nil]]
---
  def create
    @contact = Contact.new(contact_params)

    if @contact.save